load-tests/k6/results/260911-633-payment-booking-roundtrip/k6-summary-w1.txt
=== run: warmup-off0 ===
start UTC: 2026-09-11T11:55:26Z

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scenarios/payment-booking-roundtrip.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 3m30s max duration (incl. graceful stop):
              * rt_warmup: 8.00 iterations/s for 3m0s (maxVUs: 20-200, exec: confirmRoundtrip, gracefulStop: 30s)


running (0m01.0s), 007/020 VUs, 0 complete and 0 interrupted iterations
rt_warmup   [   0% ] 007/020 VUs  0m00.8s/3m0s  8.00 iters/s

running (0m02.0s), 015/020 VUs, 0 complete and 0 interrupted iterations
rt_warmup   [   1% ] 015/020 VUs  0m01.8s/3m0s  8.00 iters/s

running (0m03.0s), 010/021 VUs, 12 complete and 0 interrupted iterations
rt_warmup   [   2% ] 010/021 VUs  0m02.8s/3m0s  8.00 iters/s

running (0m04.0s), 001/021 VUs, 29 complete and 0 interrupted iterations
rt_warmup   [   2% ] 001/021 VUs  0m03.8s/3m0s  8.00 iters/s

running (0m05.0s), 000/021 VUs, 38 complete and 0 interrupted iterations
rt_warmup   [   3% ] 000/021 VUs  0m04.8s/3m0s  8.00 iters/s

running (0m06.0s), 001/021 VUs, 45 complete and 0 interrupted iterations
rt_warmup   [   3% ] 001/021 VUs  0m05.8s/3m0s  8.00 iters/s

running (0m07.0s), 000/021 VUs, 54 complete and 0 interrupted iterations
rt_warmup   [   4% ] 000/021 VUs  0m06.8s/3m0s  8.00 iters/s

running (0m08.0s), 000/021 VUs, 62 complete and 0 interrupted iterations
rt_warmup   [   4% ] 000/021 VUs  0m07.8s/3m0s  8.00 iters/s

running (0m09.0s), 000/021 VUs, 70 complete and 0 interrupted iterations
rt_warmup   [   5% ] 000/021 VUs  0m08.8s/3m0s  8.00 iters/s

running (0m10.0s), 000/021 VUs, 78 complete and 0 interrupted iterations
rt_warmup   [   5% ] 000/021 VUs  0m09.8s/3m0s  8.00 iters/s

running (0m11.0s), 000/021 VUs, 86 complete and 0 interrupted iterations
rt_warmup   [   6% ] 000/021 VUs  0m10.8s/3m0s  8.00 iters/s

running (0m12.0s), 000/021 VUs, 94 complete and 0 interrupted iterations
rt_warmup   [   7% ] 000/021 VUs  0m11.8s/3m0s  8.00 iters/s

running (0m13.0s), 001/021 VUs, 101 complete and 0 interrupted iterations
rt_warmup   [   7% ] 001/021 VUs  0m12.8s/3m0s  8.00 iters/s

running (0m14.0s), 001/021 VUs, 109 complete and 0 interrupted iterations
rt_warmup   [   8% ] 001/021 VUs  0m13.8s/3m0s  8.00 iters/s

running (0m15.0s), 001/021 VUs, 117 complete and 0 interrupted iterations
rt_warmup   [   8% ] 001/021 VUs  0m14.8s/3m0s  8.00 iters/s

running (0m16.0s), 000/021 VUs, 126 complete and 0 interrupted iterations
rt_warmup   [   9% ] 000/021 VUs  0m15.8s/3m0s  8.00 iters/s

running (0m17.0s), 000/021 VUs, 134 complete and 0 interrupted iterations
rt_warmup   [   9% ] 000/021 VUs  0m16.8s/3m0s  8.00 iters/s

running (0m18.0s), 000/021 VUs, 142 complete and 0 interrupted iterations
rt_warmup   [  10% ] 000/021 VUs  0m17.8s/3m0s  8.00 iters/s

running (0m19.0s), 000/021 VUs, 150 complete and 0 interrupted iterations
rt_warmup   [  10% ] 000/021 VUs  0m18.8s/3m0s  8.00 iters/s

running (0m20.0s), 000/021 VUs, 158 complete and 0 interrupted iterations
rt_warmup   [  11% ] 000/021 VUs  0m19.8s/3m0s  8.00 iters/s

running (0m21.0s), 000/021 VUs, 166 complete and 0 interrupted iterations
rt_warmup   [  12% ] 000/021 VUs  0m20.8s/3m0s  8.00 iters/s

running (0m22.0s), 000/021 VUs, 174 complete and 0 interrupted iterations
rt_warmup   [  12% ] 000/021 VUs  0m21.8s/3m0s  8.00 iters/s

running (0m23.0s), 000/021 VUs, 182 complete and 0 interrupted iterations
rt_warmup   [  13% ] 000/021 VUs  0m22.8s/3m0s  8.00 iters/s

running (0m24.0s), 001/021 VUs, 189 complete and 0 interrupted iterations
rt_warmup   [  13% ] 001/021 VUs  0m23.8s/3m0s  8.00 iters/s

running (0m25.0s), 001/021 VUs, 197 complete and 0 interrupted iterations
rt_warmup   [  14% ] 001/021 VUs  0m24.8s/3m0s  8.00 iters/s

running (0m26.0s), 000/021 VUs, 206 complete and 0 interrupted iterations
rt_warmup   [  14% ] 000/021 VUs  0m25.8s/3m0s  8.00 iters/s

running (0m27.0s), 000/021 VUs, 214 complete and 0 interrupted iterations
rt_warmup   [  15% ] 000/021 VUs  0m26.8s/3m0s  8.00 iters/s

running (0m28.0s), 000/021 VUs, 222 complete and 0 interrupted iterations
rt_warmup   [  15% ] 000/021 VUs  0m27.8s/3m0s  8.00 iters/s

running (0m29.0s), 000/021 VUs, 230 complete and 0 interrupted iterations
rt_warmup   [  16% ] 000/021 VUs  0m28.8s/3m0s  8.00 iters/s

running (0m30.0s), 000/021 VUs, 238 complete and 0 interrupted iterations
rt_warmup   [  17% ] 000/021 VUs  0m29.8s/3m0s  8.00 iters/s

running (0m31.0s), 000/021 VUs, 246 complete and 0 interrupted iterations
rt_warmup   [  17% ] 000/021 VUs  0m30.8s/3m0s  8.00 iters/s

running (0m32.0s), 000/021 VUs, 254 complete and 0 interrupted iterations
rt_warmup   [  18% ] 000/021 VUs  0m31.8s/3m0s  8.00 iters/s

running (0m33.0s), 000/021 VUs, 262 complete and 0 interrupted iterations
rt_warmup   [  18% ] 000/021 VUs  0m32.8s/3m0s  8.00 iters/s

running (0m34.0s), 000/021 VUs, 270 complete and 0 interrupted iterations
rt_warmup   [  19% ] 000/021 VUs  0m33.8s/3m0s  8.00 iters/s

running (0m35.0s), 001/021 VUs, 277 complete and 0 interrupted iterations
rt_warmup   [  19% ] 001/021 VUs  0m34.8s/3m0s  8.00 iters/s

running (0m36.0s), 001/021 VUs, 285 complete and 0 interrupted iterations
rt_warmup   [  20% ] 001/021 VUs  0m35.8s/3m0s  8.00 iters/s

running (0m37.0s), 000/021 VUs, 294 complete and 0 interrupted iterations
rt_warmup   [  20% ] 000/021 VUs  0m36.8s/3m0s  8.00 iters/s

running (0m38.0s), 000/021 VUs, 302 complete and 0 interrupted iterations
rt_warmup   [  21% ] 000/021 VUs  0m37.8s/3m0s  8.00 iters/s

running (0m39.0s), 000/021 VUs, 310 complete and 0 interrupted iterations
rt_warmup   [  22% ] 000/021 VUs  0m38.8s/3m0s  8.00 iters/s

running (0m40.0s), 000/021 VUs, 318 complete and 0 interrupted iterations
rt_warmup   [  22% ] 000/021 VUs  0m39.8s/3m0s  8.00 iters/s

running (0m41.0s), 000/021 VUs, 326 complete and 0 interrupted iterations
rt_warmup   [  23% ] 000/021 VUs  0m40.8s/3m0s  8.00 iters/s

running (0m42.0s), 000/021 VUs, 334 complete and 0 interrupted iterations
rt_warmup   [  23% ] 000/021 VUs  0m41.8s/3m0s  8.00 iters/s

running (0m43.0s), 000/021 VUs, 342 complete and 0 interrupted iterations
rt_warmup   [  24% ] 000/021 VUs  0m42.8s/3m0s  8.00 iters/s

running (0m44.0s), 000/021 VUs, 350 complete and 0 interrupted iterations
rt_warmup   [  24% ] 000/021 VUs  0m43.8s/3m0s  8.00 iters/s

running (0m45.0s), 000/021 VUs, 358 complete and 0 interrupted iterations
rt_warmup   [  25% ] 000/021 VUs  0m44.8s/3m0s  8.00 iters/s

running (0m46.0s), 001/021 VUs, 365 complete and 0 interrupted iterations
rt_warmup   [  25% ] 001/021 VUs  0m45.8s/3m0s  8.00 iters/s

running (0m47.0s), 001/021 VUs, 373 complete and 0 interrupted iterations
rt_warmup   [  26% ] 001/021 VUs  0m46.8s/3m0s  8.00 iters/s

running (0m48.0s), 000/021 VUs, 382 complete and 0 interrupted iterations
rt_warmup   [  27% ] 000/021 VUs  0m47.8s/3m0s  8.00 iters/s

running (0m49.0s), 000/021 VUs, 390 complete and 0 interrupted iterations
rt_warmup   [  27% ] 000/021 VUs  0m48.8s/3m0s  8.00 iters/s

running (0m50.0s), 000/021 VUs, 398 complete and 0 interrupted iterations
rt_warmup   [  28% ] 000/021 VUs  0m49.8s/3m0s  8.00 iters/s

running (0m51.0s), 000/021 VUs, 406 complete and 0 interrupted iterations
rt_warmup   [  28% ] 000/021 VUs  0m50.8s/3m0s  8.00 iters/s

running (0m52.0s), 000/021 VUs, 414 complete and 0 interrupted iterations
rt_warmup   [  29% ] 000/021 VUs  0m51.8s/3m0s  8.00 iters/s

running (0m53.0s), 000/021 VUs, 422 complete and 0 interrupted iterations
rt_warmup   [  29% ] 000/021 VUs  0m52.8s/3m0s  8.00 iters/s

running (0m54.0s), 000/021 VUs, 430 complete and 0 interrupted iterations
rt_warmup   [  30% ] 000/021 VUs  0m53.8s/3m0s  8.00 iters/s

running (0m55.0s), 000/021 VUs, 438 complete and 0 interrupted iterations
rt_warmup   [  30% ] 000/021 VUs  0m54.8s/3m0s  8.00 iters/s

running (0m56.0s), 000/021 VUs, 446 complete and 0 interrupted iterations
rt_warmup   [  31% ] 000/021 VUs  0m55.8s/3m0s  8.00 iters/s

running (0m57.0s), 001/021 VUs, 453 complete and 0 interrupted iterations
rt_warmup   [  32% ] 001/021 VUs  0m56.8s/3m0s  8.00 iters/s

running (0m58.0s), 001/021 VUs, 461 complete and 0 interrupted iterations
rt_warmup   [  32% ] 001/021 VUs  0m57.8s/3m0s  8.00 iters/s

running (0m59.0s), 000/021 VUs, 470 complete and 0 interrupted iterations
rt_warmup   [  33% ] 000/021 VUs  0m58.8s/3m0s  8.00 iters/s

running (1m00.0s), 000/021 VUs, 478 complete and 0 interrupted iterations
rt_warmup   [  33% ] 000/021 VUs  0m59.8s/3m0s  8.00 iters/s

running (1m01.0s), 000/021 VUs, 486 complete and 0 interrupted iterations
rt_warmup   [  34% ] 000/021 VUs  1m00.8s/3m0s  8.00 iters/s

running (1m02.0s), 000/021 VUs, 494 complete and 0 interrupted iterations
rt_warmup   [  34% ] 000/021 VUs  1m01.8s/3m0s  8.00 iters/s

running (1m03.0s), 000/021 VUs, 502 complete and 0 interrupted iterations
rt_warmup   [  35% ] 000/021 VUs  1m02.8s/3m0s  8.00 iters/s

running (1m04.0s), 000/021 VUs, 510 complete and 0 interrupted iterations
rt_warmup   [  35% ] 000/021 VUs  1m03.8s/3m0s  8.00 iters/s

running (1m05.0s), 000/021 VUs, 518 complete and 0 interrupted iterations
rt_warmup   [  36% ] 000/021 VUs  1m04.8s/3m0s  8.00 iters/s

running (1m06.0s), 000/021 VUs, 526 complete and 0 interrupted iterations
rt_warmup   [  37% ] 000/021 VUs  1m05.8s/3m0s  8.00 iters/s

running (1m07.0s), 000/021 VUs, 534 complete and 0 interrupted iterations
rt_warmup   [  37% ] 000/021 VUs  1m06.8s/3m0s  8.00 iters/s

running (1m08.0s), 001/021 VUs, 541 complete and 0 interrupted iterations
rt_warmup   [  38% ] 001/021 VUs  1m07.8s/3m0s  8.00 iters/s

running (1m09.0s), 000/021 VUs, 550 complete and 0 interrupted iterations
rt_warmup   [  38% ] 000/021 VUs  1m08.8s/3m0s  8.00 iters/s

running (1m10.0s), 000/021 VUs, 558 complete and 0 interrupted iterations
rt_warmup   [  39% ] 000/021 VUs  1m09.8s/3m0s  8.00 iters/s

running (1m11.0s), 000/021 VUs, 566 complete and 0 interrupted iterations
rt_warmup   [  39% ] 000/021 VUs  1m10.8s/3m0s  8.00 iters/s

running (1m12.0s), 000/021 VUs, 574 complete and 0 interrupted iterations
rt_warmup   [  40% ] 000/021 VUs  1m11.8s/3m0s  8.00 iters/s

running (1m13.0s), 000/021 VUs, 582 complete and 0 interrupted iterations
rt_warmup   [  40% ] 000/021 VUs  1m12.8s/3m0s  8.00 iters/s

running (1m14.0s), 000/021 VUs, 590 complete and 0 interrupted iterations
rt_warmup   [  41% ] 000/021 VUs  1m13.8s/3m0s  8.00 iters/s

running (1m15.0s), 000/021 VUs, 598 complete and 0 interrupted iterations
rt_warmup   [  42% ] 000/021 VUs  1m14.8s/3m0s  8.00 iters/s

running (1m16.0s), 000/021 VUs, 606 complete and 0 interrupted iterations
rt_warmup   [  42% ] 000/021 VUs  1m15.8s/3m0s  8.00 iters/s

running (1m17.0s), 000/021 VUs, 614 complete and 0 interrupted iterations
rt_warmup   [  43% ] 000/021 VUs  1m16.8s/3m0s  8.00 iters/s

running (1m18.0s), 001/021 VUs, 621 complete and 0 interrupted iterations
rt_warmup   [  43% ] 001/021 VUs  1m17.8s/3m0s  8.00 iters/s

running (1m19.0s), 001/021 VUs, 629 complete and 0 interrupted iterations
rt_warmup   [  44% ] 001/021 VUs  1m18.8s/3m0s  8.00 iters/s

running (1m20.0s), 000/021 VUs, 638 complete and 0 interrupted iterations
rt_warmup   [  44% ] 000/021 VUs  1m19.8s/3m0s  8.00 iters/s

running (1m21.0s), 000/021 VUs, 646 complete and 0 interrupted iterations
rt_warmup   [  45% ] 000/021 VUs  1m20.8s/3m0s  8.00 iters/s

running (1m22.0s), 000/021 VUs, 654 complete and 0 interrupted iterations
rt_warmup   [  45% ] 000/021 VUs  1m21.8s/3m0s  8.00 iters/s

running (1m23.0s), 000/021 VUs, 662 complete and 0 interrupted iterations
rt_warmup   [  46% ] 000/021 VUs  1m22.8s/3m0s  8.00 iters/s

running (1m24.0s), 000/021 VUs, 670 complete and 0 interrupted iterations
rt_warmup   [  47% ] 000/021 VUs  1m23.8s/3m0s  8.00 iters/s

running (1m25.0s), 000/021 VUs, 678 complete and 0 interrupted iterations
rt_warmup   [  47% ] 000/021 VUs  1m24.8s/3m0s  8.00 iters/s

running (1m26.0s), 000/021 VUs, 686 complete and 0 interrupted iterations
rt_warmup   [  48% ] 000/021 VUs  1m25.8s/3m0s  8.00 iters/s

running (1m27.0s), 000/021 VUs, 694 complete and 0 interrupted iterations
rt_warmup   [  48% ] 000/021 VUs  1m26.8s/3m0s  8.00 iters/s

running (1m28.0s), 000/021 VUs, 702 complete and 0 interrupted iterations
rt_warmup   [  49% ] 000/021 VUs  1m27.8s/3m0s  8.00 iters/s

running (1m29.0s), 001/021 VUs, 709 complete and 0 interrupted iterations
rt_warmup   [  49% ] 001/021 VUs  1m28.8s/3m0s  8.00 iters/s

running (1m30.0s), 001/021 VUs, 717 complete and 0 interrupted iterations
rt_warmup   [  50% ] 001/021 VUs  1m29.8s/3m0s  8.00 iters/s

running (1m31.0s), 000/021 VUs, 726 complete and 0 interrupted iterations
rt_warmup   [  50% ] 000/021 VUs  1m30.8s/3m0s  8.00 iters/s

running (1m32.0s), 000/021 VUs, 734 complete and 0 interrupted iterations
rt_warmup   [  51% ] 000/021 VUs  1m31.8s/3m0s  8.00 iters/s

running (1m33.0s), 000/021 VUs, 742 complete and 0 interrupted iterations
rt_warmup   [  52% ] 000/021 VUs  1m32.8s/3m0s  8.00 iters/s

running (1m34.0s), 000/021 VUs, 750 complete and 0 interrupted iterations
rt_warmup   [  52% ] 000/021 VUs  1m33.8s/3m0s  8.00 iters/s

running (1m35.0s), 000/021 VUs, 758 complete and 0 interrupted iterations
rt_warmup   [  53% ] 000/021 VUs  1m34.8s/3m0s  8.00 iters/s

running (1m36.0s), 000/021 VUs, 766 complete and 0 interrupted iterations
rt_warmup   [  53% ] 000/021 VUs  1m35.8s/3m0s  8.00 iters/s

running (1m37.0s), 000/021 VUs, 774 complete and 0 interrupted iterations
rt_warmup   [  54% ] 000/021 VUs  1m36.8s/3m0s  8.00 iters/s

running (1m38.0s), 000/021 VUs, 782 complete and 0 interrupted iterations
rt_warmup   [  54% ] 000/021 VUs  1m37.8s/3m0s  8.00 iters/s

running (1m39.0s), 000/021 VUs, 790 complete and 0 interrupted iterations
rt_warmup   [  55% ] 000/021 VUs  1m38.8s/3m0s  8.00 iters/s

running (1m40.0s), 001/021 VUs, 797 complete and 0 interrupted iterations
rt_warmup   [  55% ] 001/021 VUs  1m39.8s/3m0s  8.00 iters/s

running (1m41.0s), 001/021 VUs, 805 complete and 0 interrupted iterations
rt_warmup   [  56% ] 001/021 VUs  1m40.8s/3m0s  8.00 iters/s

running (1m42.0s), 000/021 VUs, 814 complete and 0 interrupted iterations
rt_warmup   [  57% ] 000/021 VUs  1m41.8s/3m0s  8.00 iters/s

running (1m43.0s), 000/021 VUs, 822 complete and 0 interrupted iterations
rt_warmup   [  57% ] 000/021 VUs  1m42.8s/3m0s  8.00 iters/s

running (1m44.0s), 000/021 VUs, 830 complete and 0 interrupted iterations
rt_warmup   [  58% ] 000/021 VUs  1m43.8s/3m0s  8.00 iters/s

running (1m45.0s), 000/021 VUs, 838 complete and 0 interrupted iterations
rt_warmup   [  58% ] 000/021 VUs  1m44.8s/3m0s  8.00 iters/s

running (1m46.0s), 000/021 VUs, 846 complete and 0 interrupted iterations
rt_warmup   [  59% ] 000/021 VUs  1m45.8s/3m0s  8.00 iters/s

running (1m47.0s), 000/021 VUs, 854 complete and 0 interrupted iterations
rt_warmup   [  59% ] 000/021 VUs  1m46.8s/3m0s  8.00 iters/s

running (1m48.0s), 000/021 VUs, 862 complete and 0 interrupted iterations
rt_warmup   [  60% ] 000/021 VUs  1m47.8s/3m0s  8.00 iters/s

running (1m49.0s), 000/021 VUs, 870 complete and 0 interrupted iterations
rt_warmup   [  60% ] 000/021 VUs  1m48.8s/3m0s  8.00 iters/s

running (1m50.0s), 000/021 VUs, 878 complete and 0 interrupted iterations
rt_warmup   [  61% ] 000/021 VUs  1m49.8s/3m0s  8.00 iters/s

running (1m51.0s), 001/021 VUs, 885 complete and 0 interrupted iterations
rt_warmup   [  62% ] 001/021 VUs  1m50.8s/3m0s  8.00 iters/s

running (1m52.0s), 001/021 VUs, 893 complete and 0 interrupted iterations
rt_warmup   [  62% ] 001/021 VUs  1m51.8s/3m0s  8.00 iters/s

running (1m53.0s), 000/021 VUs, 902 complete and 0 interrupted iterations
rt_warmup   [  63% ] 000/021 VUs  1m52.8s/3m0s  8.00 iters/s

running (1m54.0s), 000/021 VUs, 910 complete and 0 interrupted iterations
rt_warmup   [  63% ] 000/021 VUs  1m53.8s/3m0s  8.00 iters/s

running (1m55.0s), 000/021 VUs, 918 complete and 0 interrupted iterations
rt_warmup   [  64% ] 000/021 VUs  1m54.8s/3m0s  8.00 iters/s

running (1m56.0s), 000/021 VUs, 926 complete and 0 interrupted iterations
rt_warmup   [  64% ] 000/021 VUs  1m55.8s/3m0s  8.00 iters/s

running (1m57.0s), 000/021 VUs, 934 complete and 0 interrupted iterations
rt_warmup   [  65% ] 000/021 VUs  1m56.8s/3m0s  8.00 iters/s

running (1m58.0s), 000/021 VUs, 942 complete and 0 interrupted iterations
rt_warmup   [  65% ] 000/021 VUs  1m57.8s/3m0s  8.00 iters/s

running (1m59.0s), 000/021 VUs, 950 complete and 0 interrupted iterations
rt_warmup   [  66% ] 000/021 VUs  1m58.8s/3m0s  8.00 iters/s

running (2m00.0s), 000/021 VUs, 958 complete and 0 interrupted iterations
rt_warmup   [  67% ] 000/021 VUs  1m59.8s/3m0s  8.00 iters/s

running (2m01.0s), 000/021 VUs, 966 complete and 0 interrupted iterations
rt_warmup   [  67% ] 000/021 VUs  2m00.8s/3m0s  8.00 iters/s

running (2m02.0s), 001/021 VUs, 973 complete and 0 interrupted iterations
rt_warmup   [  68% ] 001/021 VUs  2m01.8s/3m0s  8.00 iters/s

running (2m03.0s), 000/021 VUs, 982 complete and 0 interrupted iterations
rt_warmup   [  68% ] 000/021 VUs  2m02.8s/3m0s  8.00 iters/s

running (2m04.0s), 000/021 VUs, 990 complete and 0 interrupted iterations
rt_warmup   [  69% ] 000/021 VUs  2m03.8s/3m0s  8.00 iters/s

running (2m05.0s), 000/021 VUs, 998 complete and 0 interrupted iterations
rt_warmup   [  69% ] 000/021 VUs  2m04.8s/3m0s  8.00 iters/s

running (2m06.0s), 000/021 VUs, 1006 complete and 0 interrupted iterations
rt_warmup   [  70% ] 000/021 VUs  2m05.8s/3m0s  8.00 iters/s

running (2m07.0s), 000/021 VUs, 1014 complete and 0 interrupted iterations
rt_warmup   [  70% ] 000/021 VUs  2m06.8s/3m0s  8.00 iters/s

running (2m08.0s), 000/021 VUs, 1022 complete and 0 interrupted iterations
rt_warmup   [  71% ] 000/021 VUs  2m07.8s/3m0s  8.00 iters/s

running (2m09.0s), 000/021 VUs, 1030 complete and 0 interrupted iterations
rt_warmup   [  72% ] 000/021 VUs  2m08.8s/3m0s  8.00 iters/s

running (2m10.0s), 000/021 VUs, 1038 complete and 0 interrupted iterations
rt_warmup   [  72% ] 000/021 VUs  2m09.8s/3m0s  8.00 iters/s

running (2m11.0s), 000/021 VUs, 1046 complete and 0 interrupted iterations
rt_warmup   [  73% ] 000/021 VUs  2m10.8s/3m0s  8.00 iters/s

running (2m12.0s), 001/021 VUs, 1053 complete and 0 interrupted iterations
rt_warmup   [  73% ] 001/021 VUs  2m11.8s/3m0s  8.00 iters/s

running (2m13.0s), 001/021 VUs, 1061 complete and 0 interrupted iterations
rt_warmup   [  74% ] 001/021 VUs  2m12.8s/3m0s  8.00 iters/s

running (2m14.0s), 000/021 VUs, 1070 complete and 0 interrupted iterations
rt_warmup   [  74% ] 000/021 VUs  2m13.8s/3m0s  8.00 iters/s

running (2m15.0s), 000/021 VUs, 1078 complete and 0 interrupted iterations
rt_warmup   [  75% ] 000/021 VUs  2m14.8s/3m0s  8.00 iters/s

running (2m16.0s), 000/021 VUs, 1086 complete and 0 interrupted iterations
rt_warmup   [  75% ] 000/021 VUs  2m15.8s/3m0s  8.00 iters/s

running (2m17.0s), 000/021 VUs, 1094 complete and 0 interrupted iterations
rt_warmup   [  76% ] 000/021 VUs  2m16.8s/3m0s  8.00 iters/s

running (2m18.0s), 000/021 VUs, 1102 complete and 0 interrupted iterations
rt_warmup   [  77% ] 000/021 VUs  2m17.8s/3m0s  8.00 iters/s

running (2m19.0s), 000/021 VUs, 1110 complete and 0 interrupted iterations
rt_warmup   [  77% ] 000/021 VUs  2m18.8s/3m0s  8.00 iters/s

running (2m20.0s), 000/021 VUs, 1118 complete and 0 interrupted iterations
rt_warmup   [  78% ] 000/021 VUs  2m19.8s/3m0s  8.00 iters/s

running (2m21.0s), 000/021 VUs, 1126 complete and 0 interrupted iterations
rt_warmup   [  78% ] 000/021 VUs  2m20.8s/3m0s  8.00 iters/s

running (2m22.0s), 000/021 VUs, 1134 complete and 0 interrupted iterations
rt_warmup   [  79% ] 000/021 VUs  2m21.8s/3m0s  8.00 iters/s

running (2m23.0s), 001/021 VUs, 1141 complete and 0 interrupted iterations
rt_warmup   [  79% ] 001/021 VUs  2m22.8s/3m0s  8.00 iters/s

running (2m24.0s), 001/021 VUs, 1149 complete and 0 interrupted iterations
rt_warmup   [  80% ] 001/021 VUs  2m23.8s/3m0s  8.00 iters/s

running (2m25.0s), 000/021 VUs, 1158 complete and 0 interrupted iterations
rt_warmup   [  80% ] 000/021 VUs  2m24.8s/3m0s  8.00 iters/s

running (2m26.0s), 000/021 VUs, 1166 complete and 0 interrupted iterations
rt_warmup   [  81% ] 000/021 VUs  2m25.8s/3m0s  8.00 iters/s

running (2m27.0s), 000/021 VUs, 1174 complete and 0 interrupted iterations
rt_warmup   [  82% ] 000/021 VUs  2m26.8s/3m0s  8.00 iters/s

running (2m28.0s), 000/021 VUs, 1182 complete and 0 interrupted iterations
rt_warmup   [  82% ] 000/021 VUs  2m27.8s/3m0s  8.00 iters/s

running (2m29.0s), 000/021 VUs, 1190 complete and 0 interrupted iterations
rt_warmup   [  83% ] 000/021 VUs  2m28.8s/3m0s  8.00 iters/s

running (2m30.0s), 000/021 VUs, 1198 complete and 0 interrupted iterations
rt_warmup   [  83% ] 000/021 VUs  2m29.8s/3m0s  8.00 iters/s

running (2m31.0s), 000/021 VUs, 1206 complete and 0 interrupted iterations
rt_warmup   [  84% ] 000/021 VUs  2m30.8s/3m0s  8.00 iters/s

running (2m32.0s), 000/021 VUs, 1214 complete and 0 interrupted iterations
rt_warmup   [  84% ] 000/021 VUs  2m31.8s/3m0s  8.00 iters/s

running (2m33.0s), 000/021 VUs, 1222 complete and 0 interrupted iterations
rt_warmup   [  85% ] 000/021 VUs  2m32.8s/3m0s  8.00 iters/s

running (2m34.0s), 001/021 VUs, 1229 complete and 0 interrupted iterations
rt_warmup   [  85% ] 001/021 VUs  2m33.8s/3m0s  8.00 iters/s

running (2m35.0s), 001/021 VUs, 1237 complete and 0 interrupted iterations
rt_warmup   [  86% ] 001/021 VUs  2m34.8s/3m0s  8.00 iters/s

running (2m36.0s), 000/021 VUs, 1246 complete and 0 interrupted iterations
rt_warmup   [  87% ] 000/021 VUs  2m35.8s/3m0s  8.00 iters/s

running (2m37.0s), 000/021 VUs, 1254 complete and 0 interrupted iterations
rt_warmup   [  87% ] 000/021 VUs  2m36.8s/3m0s  8.00 iters/s

running (2m38.0s), 000/021 VUs, 1262 complete and 0 interrupted iterations
rt_warmup   [  88% ] 000/021 VUs  2m37.8s/3m0s  8.00 iters/s

running (2m39.0s), 000/021 VUs, 1270 complete and 0 interrupted iterations
rt_warmup   [  88% ] 000/021 VUs  2m38.8s/3m0s  8.00 iters/s

running (2m40.0s), 000/021 VUs, 1278 complete and 0 interrupted iterations
rt_warmup   [  89% ] 000/021 VUs  2m39.8s/3m0s  8.00 iters/s

running (2m41.0s), 000/021 VUs, 1286 complete and 0 interrupted iterations
rt_warmup   [  89% ] 000/021 VUs  2m40.8s/3m0s  8.00 iters/s

running (2m42.0s), 000/021 VUs, 1294 complete and 0 interrupted iterations
rt_warmup   [  90% ] 000/021 VUs  2m41.8s/3m0s  8.00 iters/s

running (2m43.0s), 000/021 VUs, 1302 complete and 0 interrupted iterations
rt_warmup   [  90% ] 000/021 VUs  2m42.8s/3m0s  8.00 iters/s

running (2m44.0s), 000/021 VUs, 1310 complete and 0 interrupted iterations
rt_warmup   [  91% ] 000/021 VUs  2m43.8s/3m0s  8.00 iters/s

running (2m45.0s), 001/021 VUs, 1317 complete and 0 interrupted iterations
rt_warmup   [  92% ] 001/021 VUs  2m44.8s/3m0s  8.00 iters/s

running (2m46.0s), 000/021 VUs, 1326 complete and 0 interrupted iterations
rt_warmup   [  92% ] 000/021 VUs  2m45.8s/3m0s  8.00 iters/s

running (2m47.0s), 000/021 VUs, 1334 complete and 0 interrupted iterations
rt_warmup   [  93% ] 000/021 VUs  2m46.8s/3m0s  8.00 iters/s

running (2m48.0s), 000/021 VUs, 1342 complete and 0 interrupted iterations
rt_warmup   [  93% ] 000/021 VUs  2m47.8s/3m0s  8.00 iters/s

running (2m49.0s), 000/021 VUs, 1350 complete and 0 interrupted iterations
rt_warmup   [  94% ] 000/021 VUs  2m48.8s/3m0s  8.00 iters/s

running (2m50.0s), 000/021 VUs, 1358 complete and 0 interrupted iterations
rt_warmup   [  94% ] 000/021 VUs  2m49.8s/3m0s  8.00 iters/s

running (2m51.0s), 000/021 VUs, 1366 complete and 0 interrupted iterations
rt_warmup   [  95% ] 000/021 VUs  2m50.8s/3m0s  8.00 iters/s

running (2m52.0s), 000/021 VUs, 1374 complete and 0 interrupted iterations
rt_warmup   [  95% ] 000/021 VUs  2m51.8s/3m0s  8.00 iters/s

running (2m53.0s), 000/021 VUs, 1382 complete and 0 interrupted iterations
rt_warmup   [  96% ] 000/021 VUs  2m52.8s/3m0s  8.00 iters/s

running (2m54.0s), 000/021 VUs, 1390 complete and 0 interrupted iterations
rt_warmup   [  97% ] 000/021 VUs  2m53.8s/3m0s  8.00 iters/s

running (2m55.0s), 000/021 VUs, 1398 complete and 0 interrupted iterations
rt_warmup   [  97% ] 000/021 VUs  2m54.8s/3m0s  8.00 iters/s

running (2m56.0s), 001/021 VUs, 1405 complete and 0 interrupted iterations
rt_warmup   [  98% ] 001/021 VUs  2m55.8s/3m0s  8.00 iters/s

running (2m57.0s), 000/021 VUs, 1414 complete and 0 interrupted iterations
rt_warmup   [  98% ] 000/021 VUs  2m56.8s/3m0s  8.00 iters/s

running (2m58.0s), 000/021 VUs, 1422 complete and 0 interrupted iterations
rt_warmup   [  99% ] 000/021 VUs  2m57.8s/3m0s  8.00 iters/s

running (2m59.0s), 000/021 VUs, 1430 complete and 0 interrupted iterations
rt_warmup   [  99% ] 000/021 VUs  2m58.8s/3m0s  8.00 iters/s

running (3m00.0s), 000/021 VUs, 1438 complete and 0 interrupted iterations
rt_warmup   [ 100% ] 000/021 VUs  2m59.8s/3m0s  8.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<800' p(95)=108.73ms

    http_req_failed
    ✗ 'rate<0.01' rate=1.24%


  █ TOTAL RESULTS 

    checks_total.......: 1441   7.995385/s
    checks_succeeded...: 98.75% 1423 out of 1441
    checks_failed......: 1.24%  18 out of 1441

    ✓ login 200
    ✗ guard blocked(409 BOOKING_409_002)
      ↳  98% — ✓ 1422 / ✗ 18

    CUSTOM
    rt_booking_unavailable.........: 1.25%  18 out of 1440
    rt_confirm_duration............: avg=64.31ms min=18.16ms med=28.28ms max=2.7s  p(90)=95.36ms p(95)=108.59ms
    rt_guard_blocked...............: 98.75% 1422 out of 1440

    HTTP
    http_req_duration..............: avg=64.37ms min=18.16ms med=28.28ms max=2.7s  p(90)=95.49ms p(95)=108.73ms
      { expected_response:true }...: avg=43.1ms  min=18.16ms med=28.08ms max=1.02s p(90)=92.19ms p(95)=105.75ms
    http_req_failed................: 1.24%  18 out of 1441
    http_reqs......................: 1441   7.995385/s

    EXECUTION
    dropped_iterations.............: 1      0.005548/s
    iteration_duration.............: avg=65.36ms min=18.74ms med=28.81ms max=2.72s p(90)=95.82ms p(95)=109.28ms
    iterations.....................: 1440   7.989837/s
    vus............................: 0      min=0            max=15
    vus_max........................: 21     min=20           max=21

    NETWORK
    data_received..................: 1.4 MB 7.7 kB/s
    data_sent......................: 780 kB 4.3 kB/s



running (3m00.2s), 000/021 VUs, 1440 complete and 0 interrupted iterations
rt_warmup ✓ [ 100% ] 000/021 VUs  3m0s  8.00 iters/s
time="2026-09-11T20:58:26+09:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"
end   UTC: 2026-09-11T11:58:26Z